devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
/* SPDX-License-Identifier: Apache-2.0 */

#include "zb_common_stub.h"
#include "mac/includes/mac_phy.h"
#include "os/ev_timer.h"

#include <string.h>
#include <zephyr/drivers/ieee802154/tlsr8258_zigbee_bridge.h>
#include <zephyr/logging/log.h>
#include <zephyr/spinlock.h>
#include <zephyr/sys/util.h>
#include <zephyr/zigbee/zb_bootstrap.h>
#include <zephyr/zigbee/zb_config.h>

#include "zb_minimal_ccm.h"

LOG_MODULE_REGISTER(zigbee_nwk_ed_minimal, CONFIG_ZIGBEE_LOG_LEVEL);

#define NWK_ED_MINIMAL_SCAN_WINDOW_MIN_MS 3000U
#define NWK_ED_MINIMAL_SCAN_WINDOW_MAX_MS 5000U
#define NWK_ED_MINIMAL_JOIN_POLL_MS       200U
#define NWK_ED_MINIMAL_JOIN_POLL_MAX      20U
#define NWK_ED_MINIMAL_INTERVIEW_POLL_MS  200U
#define NWK_ED_MINIMAL_INTERVIEW_POLL_MAX 20U
#define NWK_ED_MINIMAL_TIMEOUT_REQ_DELAY_MS 200U
#define NWK_ED_MINIMAL_RX_EVT_Q_LEN       4U
#define NWK_ED_MINIMAL_NWK_AUX_HDR_LEN    14U
#define NWK_ED_MINIMAL_NWK_MIC_LEN        4U
#define NWK_ED_MINIMAL_NWK_SEC_CTRL       0x2DU
#define NWK_ED_MINIMAL_NWK_SEC_CTRL_WIRE  0x28U
#define NWK_ED_MINIMAL_NWK_TIMEOUT_REQ_CMD_ID 0x0BU
#define NWK_ED_MINIMAL_NWK_TIMEOUT_RSP_CMD_ID 0x0CU

typedef enum {
	NWK_ED_MINIMAL_STATE_IDLE = 0,
	NWK_ED_MINIMAL_STATE_DISCOVERY,
	NWK_ED_MINIMAL_STATE_JOINING,
	NWK_ED_MINIMAL_STATE_REJOIN,
	NWK_ED_MINIMAL_STATE_INTERVIEW,
} nwk_ed_minimal_state_t;

typedef struct {
	bool initialized;
	bool warmStart;
	nwk_ed_minimal_state_t state;
	u32 lastScanChannels;
	u8 lastScanDuration;
	u32 lastRejoinScanChannels;
	u8 lastRejoinScanDuration;
	bool rejoinWithBackoff;
	bool parentCandidateValid;
	u16 parentCandidateShortAddr;
	addrExt_t parentCandidateIeee;
	u8 lastJoinStatus;
	bool fixedJoinValid;
	u8 fixedJoinChannel;
	u16 fixedJoinPanId;
	u16 fixedJoinShortAddr;
	extPANId_t fixedJoinExtPanId;
	u8 fixedJoinNwkKey[SEC_KEY_LEN];
	addrExt_t fixedJoinTcAddr;

	u32 remainingScanChannels;
	u8 activeScanChannel;
	bool haveBeaconCandidate;
	s8 bestBeaconRssi;
	u16 candidatePanId;
	u16 candidateShortAddr;
	extPANId_t candidateExtPanId;
	bool discoveryForRejoin;
	u8 activeChannel;
	u16 activePanId;
	u16 activeParentShortAddr;
	extPANId_t activeExtPanId;
	u8 assocPollCount;
	bool interviewRejoinMode;
	u8 interviewPollCount;
	u32 interviewPollIntervalMs;
	bool endDevTimeoutRspSeen;
	bool endDevTimeoutReqScheduled;

	ev_timer_event_t opTimer;
	ev_timer_event_t timeoutReqTimer;
} nwk_ed_minimal_ctx_t;

static nwk_ed_minimal_ctx_t g_nwkEdCtx;
static struct k_spinlock g_nwkEdRxEvtLock;

typedef enum {
	NWK_ED_MINIMAL_RX_EVT_NONE = 0,
	NWK_ED_MINIMAL_RX_EVT_BEACON,
	NWK_ED_MINIMAL_RX_EVT_TRAFFIC_CANDIDATE,
	NWK_ED_MINIMAL_RX_EVT_ASSOC_RSP,
} nwk_ed_minimal_rx_evt_type_t;

typedef struct {
	nwk_ed_minimal_rx_evt_type_t type;
	s8 rssi;
	union {
		struct {
			u16 panId;
			u16 parentShortAddr;
			extPANId_t extPanId;
			u8 channel;
		} beacon;
		struct {
			u16 panId;
			u16 parentShortAddr;
			u8 channel;
		} traffic;
		struct {
			u8 macStatus;
			u16 assignedShortAddr;
			bool srcExtValid;
			addrExt_t srcExtAddr;
			bool dstExtValid;
			addrExt_t dstExtAddr;
			bool dstShortValid;
			u16 dstShortAddr;
			bool srcShortValid;
			u16 srcShortAddr;
		} assocRsp;
	};
} nwk_ed_minimal_rx_evt_t;

static nwk_ed_minimal_rx_evt_t g_nwkEdRxEvtQ[NWK_ED_MINIMAL_RX_EVT_Q_LEN];
static u8 g_nwkEdRxEvtHead;
static u8 g_nwkEdRxEvtTail;
static u8 g_nwkEdRxEvtCount;

static void nwk_ed_minimal_joined_idle_poll_schedule(u32 timeoutMs);
static void nwk_ed_minimal_timeout_req_schedule(u32 timeoutMs);

extern void tl_zdoEdMinimalDiscoveryDone(u8 status);
extern void tl_zdoEdMinimalJoinDone(u8 status, bool rejoinMode);
extern u8 zb_zdoSendDevAnnance(void);

static u16 nwk_ed_minimal_u16_from_le(const u8 *buf)
{
	return ((u16)buf[1] << 8) | (u16)buf[0];
}

static bool nwk_ed_minimal_channel_mask_contains(u32 mask, u8 ch)
{
	return (ch <= 31U) && ((mask & ((u32)1U << ch)) != 0U);
}

static u8 nwk_ed_minimal_next_scan_channel(u32 mask, u8 startExclusive)
{
	for (u8 ch = (u8)(startExclusive + 1U); ch <= TL_ZB_MAC_CHANNEL_STOP; ch++) {
		if (nwk_ed_minimal_channel_mask_contains(mask, ch)) {
			return ch;
		}
	}

	return 0xFFU;
}

static u32 nwk_ed_minimal_scan_window_ms(u8 scanDuration)
{
	u8 bounded = (scanDuration > 8U) ? 8U : scanDuration;
	u32 window = 16U * (((u32)1U << bounded) + 1U);

	if (window < NWK_ED_MINIMAL_SCAN_WINDOW_MIN_MS) {
		return NWK_ED_MINIMAL_SCAN_WINDOW_MIN_MS;
	}
	if (window > NWK_ED_MINIMAL_SCAN_WINDOW_MAX_MS) {
		return NWK_ED_MINIMAL_SCAN_WINDOW_MAX_MS;
	}

	return window;
}

static void nwk_ed_minimal_timer_cancel(void)
{
	ev_unon_timer(&g_nwkEdCtx.opTimer);
}

static void nwk_ed_minimal_timeout_req_cancel(void)
{
	ev_unon_timer(&g_nwkEdCtx.timeoutReqTimer);
}

static void nwk_ed_minimal_timer_start(u32 timeoutMs);
static void nwk_ed_minimal_joined_idle_poll_restart(u32 timeoutMs);
static void nwk_ed_minimal_post_join_announce_task(void *arg);
static void nwk_ed_minimal_timeout_req_task(void *arg);
static void nwk_ed_minimal_rx_event_task(void *arg);
void tl_zbNwkEdMinimalInterviewPollStart(u8 count, u32 intervalMs);

static u32 nwk_ed_minimal_effective_poll_rate(void)
{
	u32 rate = zdo_af_get_syn_rate();

	return (rate != 0U) ? rate : POLL_RATE;
}

typedef struct {
	u16 fcf;
	u8 frameType;
	u8 srcAddrMode;
	u8 dstAddrMode;
	u8 headerLen;
	bool srcPanValid;
	u16 srcPanId;
	bool srcExtValid;
	addrExt_t srcExtAddr;
	bool srcShortValid;
	u16 srcShortAddr;
	bool dstShortValid;
	u16 dstShortAddr;
	bool dstExtValid;
	addrExt_t dstExtAddr;
} nwk_ed_minimal_mac_hdr_t;

static bool nwk_ed_minimal_parse_mac_header(const u8 *psdu, u8 len, nwk_ed_minimal_mac_hdr_t *out)
{
	u16 fcf;
	u8 idx = MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN;
	u16 dstPanId = MAC_INVALID_PANID;

	if (psdu == NULL || out == NULL || len < idx) {
		return FALSE;
	}

	memset(out, 0, sizeof(*out));
	fcf = nwk_ed_minimal_u16_from_le(psdu);
	out->fcf = fcf;
	out->frameType = (u8)((fcf & MAC_FCF_FRAME_TYPE_MASK) >> MAC_FCF_FRAME_TYPE_POS);
	out->dstAddrMode = (u8)((fcf & MAC_FCF_DST_ADDR_MODE_MASK) >> MAC_FCF_DST_ADDR_MODE_POS);
	out->srcAddrMode = (u8)((fcf & MAC_FCF_SRC_ADDR_MODE_MASK) >> MAC_FCF_SRC_ADDR_MODE_POS);

