devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
	if (out->dstAddrMode != ZB_ADDR_NO_ADDR) {
		u8 dstAddrLen;

		if (idx + MAC_PAN_ID_FIELD_LEN > len) {
			return FALSE;
		}
		dstPanId = nwk_ed_minimal_u16_from_le(&psdu[idx]);
		idx += MAC_PAN_ID_FIELD_LEN;

		if (out->dstAddrMode == ZB_ADDR_16BIT_DEV_OR_BROADCAST) {
			dstAddrLen = MAC_SHORT_ADDR_FIELD_LEN;
			if (idx + dstAddrLen > len) {
				return FALSE;
			}
			out->dstShortAddr = nwk_ed_minimal_u16_from_le(&psdu[idx]);
			out->dstShortValid = TRUE;
		} else if (out->dstAddrMode == ZB_ADDR_64BIT_DEV) {
			dstAddrLen = MAC_EXT_ADDR_FIELD_LEN;
			if (idx + dstAddrLen > len) {
				return FALSE;
			}
			memcpy(out->dstExtAddr, &psdu[idx], sizeof(out->dstExtAddr));
			out->dstExtValid = TRUE;
		} else {
			return FALSE;
		}

		idx += dstAddrLen;
	}

	if (out->srcAddrMode != ZB_ADDR_NO_ADDR) {
		u8 srcAddrLen;

		if ((fcf & MAC_FCF_INTRA_PAN_MASK) != 0U && out->dstAddrMode != ZB_ADDR_NO_ADDR) {
			out->srcPanId = dstPanId;
			out->srcPanValid = TRUE;
		} else {
			if (idx + MAC_PAN_ID_FIELD_LEN > len) {
				return FALSE;
			}
			out->srcPanId = nwk_ed_minimal_u16_from_le(&psdu[idx]);
			out->srcPanValid = TRUE;
			idx += MAC_PAN_ID_FIELD_LEN;
		}

		if (out->srcAddrMode == ZB_ADDR_16BIT_DEV_OR_BROADCAST) {
			srcAddrLen = MAC_SHORT_ADDR_FIELD_LEN;
			if (idx + srcAddrLen > len) {
				return FALSE;
			}
			out->srcShortAddr = nwk_ed_minimal_u16_from_le(&psdu[idx]);
			out->srcShortValid = TRUE;
		} else if (out->srcAddrMode == ZB_ADDR_64BIT_DEV) {
			srcAddrLen = MAC_EXT_ADDR_FIELD_LEN;
			if (idx + srcAddrLen > len) {
				return FALSE;
			}
			memcpy(out->srcExtAddr, &psdu[idx], sizeof(out->srcExtAddr));
			out->srcExtValid = TRUE;
		} else {
			return FALSE;
		}

		idx += srcAddrLen;
	}

	out->headerLen = idx;
	return TRUE;
}

static void nwk_ed_minimal_apply_tc_context(void)
{
	const u8 *tcAddr = NULL;
	bool centralized = FALSE;

	if (!ZB_IEEE_ADDR_IS_ZERO(g_nwkEdCtx.fixedJoinTcAddr) &&
	    !ZB_IEEE_ADDR_IS_INVALID(g_nwkEdCtx.fixedJoinTcAddr)) {
		tcAddr = g_nwkEdCtx.fixedJoinTcAddr;
		centralized = TRUE;
	} else if (!ZB_IEEE_ADDR_IS_ZERO(ss_ib.trust_center_address) &&
		   !ZB_IEEE_ADDR_IS_INVALID(ss_ib.trust_center_address)) {
		tcAddr = ss_ib.trust_center_address;
		centralized = TRUE;
	}

	if (centralized) {
		ss_securityModeSet(SS_SEMODE_CENTRALIZED);
		ZB_IEEE_ADDR_COPY(ss_ib.trust_center_address, tcAddr);
		LOG_INF("join security: centralized tc=%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
			tcAddr[0], tcAddr[1], tcAddr[2], tcAddr[3],
			tcAddr[4], tcAddr[5], tcAddr[6], tcAddr[7]);
	} else {
		ZB_IEEE_ADDR_INVALID(ss_ib.trust_center_address);
		ss_securityModeSet(SS_SEMODE_DISTRIBUTED);
		LOG_INF("join security: distributed/no tc");
	}
}

static bool nwk_ed_minimal_parse_beacon_candidate(const u8 *psdu, u8 len,
						  const nwk_ed_minimal_mac_hdr_t *hdr,
						  u16 *panId, u16 *coordShortAddr, extPANId_t extPanId)
{
	u8 idx;
	u8 gtsSpec;
	u8 pendingSpec;
	u8 gtsDescCount;
	u8 pendingShortCount;
	u8 pendingExtCount;
	u8 superframeSpec2;

	if (psdu == NULL || hdr == NULL || panId == NULL || coordShortAddr == NULL ||
	    extPanId == NULL || !hdr->srcPanValid || !hdr->srcShortValid) {
		return FALSE;
	}

	idx = hdr->headerLen;
	if (idx + 3U > len) {
		return FALSE;
	}

	/*
	 * Vendor discovery path does not reject beacons solely because the
	 * association-permit bit is clear. It only requires the upper
	 * superframe/capability byte to carry non-zero network information and
	 * lets the later association attempt determine if joining is currently
	 * permitted.
	 */
	superframeSpec2 = psdu[idx + 1U];
	if ((superframeSpec2 & 0x7FU) == 0U) {
		return FALSE;
	}

	idx += 2U;
	gtsSpec = psdu[idx++];
	gtsDescCount = (u8)(gtsSpec & 0x07U);
	if (gtsDescCount > 0U) {
		u8 gtsLen = (u8)(1U + (gtsDescCount * 3U));
		if (idx + gtsLen > len) {
			return FALSE;
		}
		idx = (u8)(idx + gtsLen);
	}

	if (idx + 1U > len) {
		return FALSE;
	}
	pendingSpec = psdu[idx++];
	pendingShortCount = (u8)(pendingSpec & 0x07U);
	pendingExtCount = (u8)((pendingSpec >> 4) & 0x07U);

	if (idx + (pendingShortCount * 2U) + (pendingExtCount * 8U) + 11U > len) {
		return FALSE;
	}
	idx = (u8)(idx + (pendingShortCount * 2U) + (pendingExtCount * 8U));

	/* Beacon payload: protocol_id(1), stack/version(1), capacity/depth(1), extPAN(8), ... */
	memcpy(extPanId, &psdu[idx + 3U], sizeof(extPANId_t));
	*panId = hdr->srcPanId;
	*coordShortAddr = hdr->srcShortAddr;

	return TRUE;
}

static void nwk_ed_minimal_channel_set(u8 channel)
{
	rf_setChannel(channel);
	(void)tl_zbMacAttrSet(MAC_PHY_ATTR_CURRENT_CHANNEL, &channel, sizeof(channel));
}

static u8 *nwk_ed_minimal_active_nwk_key_get(void)
{
	if (ss_ib.activeSecureMaterialIndex >= SECUR_N_SECUR_MATERIAL) {
		return NULL;
	}

	return ss_ib.nwkSecurMaterialSet[ss_ib.activeSecureMaterialIndex].key;
}

static u8 nwk_ed_minimal_timeout_req_value_get(void)
{
	if (g_zbNIB.endDevTimeoutDefault < REQTIMEOUTENUM_INVALID) {
		return g_zbNIB.endDevTimeoutDefault;
	}

	return NWK_ENDDEV_TIMEOUT_DEFAULT;
}

static bool nwk_ed_minimal_send_timeout_request(void)
{
	u8 frame[127];
	u8 nonce[13];
	u8 *key;
	u8 timeoutReq;
	u8 enc_len;
	u8 nwkHdrLen;
	u8 *payload;
	u32 frameCounter;
	u8 keySeq;
	u8 idx = 0U;
	u16 nwkFcf = 0U;
	u16 macFcf = 0U;
	int rc;

	if (!g_zbNwkCtx.joined || g_nwkEdCtx.activePanId == MAC_INVALID_PANID ||
	    g_nwkEdCtx.activeParentShortAddr == MAC_SHORT_ADDR_NONE ||
	    g_zbNIB.nwkAddr >= ZB_MAC_SHORT_ADDR_NOT_ALLOCATED) {
		return FALSE;
	}

	key = nwk_ed_minimal_active_nwk_key_get();
	if (key == NULL) {
		LOG_WRN("joined TX: timeout req skipped, no active nwk key");
		return FALSE;
	}

	macFcf |= MAC_FRAME_DATA;
	macFcf |= MAC_FCF_ACK_REQ_BIT;
	macFcf |= MAC_FCF_INTRA_PAN_MASK;
	macFcf |= (u16)ZB_ADDR_16BIT_DEV_OR_BROADCAST << MAC_FCF_DST_ADDR_MODE_POS;
	macFcf |= (u16)ZB_ADDR_16BIT_DEV_OR_BROADCAST << MAC_FCF_SRC_ADDR_MODE_POS;

	COPY_U16TOBUFFER(&frame[idx], macFcf);
	idx += MAC_FCF_FIELD_LEN;
	frame[idx++] = ZB_MAC_DSN();
	ZB_INC_MAC_DSN();
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activePanId);
	idx += MAC_PAN_ID_FIELD_LEN;
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activeParentShortAddr);
	idx += MAC_SHORT_ADDR_FIELD_LEN;
	COPY_U16TOBUFFER(&frame[idx], g_zbNIB.nwkAddr);
	idx += MAC_SHORT_ADDR_FIELD_LEN;

	nwkFcf |= (u16)FRAME_TYPE_COMMAND;
	nwkFcf |= (u16)(0x02U << 2);
	nwkFcf |= BIT(9);
	nwkFcf |= BIT(13);

