devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
	COPY_U16TOBUFFER(&frame[idx], nwkFcf);
	idx += 2U;
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activeParentShortAddr);
	idx += 2U;
	COPY_U16TOBUFFER(&frame[idx], g_zbNIB.nwkAddr);
	idx += 2U;
	frame[idx++] = 1U;
	frame[idx++] = g_zbNIB.seqNum++;
	nwkHdrLen = (u8)(8U + NWK_ED_MINIMAL_NWK_AUX_HDR_LEN);
	frame[idx++] = NWK_ED_MINIMAL_NWK_SEC_CTRL;
	frameCounter = ss_ib.outgoingFrameCounter++;
	COPY_U32TOBUFFER(&frame[idx], frameCounter);
	idx += 4U;
	memcpy(&frame[idx], g_zbMacPib.extAddress, sizeof(addrExt_t));
	idx += sizeof(addrExt_t);
	keySeq = ss_ib.activeKeySeqNum;
	frame[idx++] = keySeq;

	timeoutReq = nwk_ed_minimal_timeout_req_value_get();
	payload = &frame[idx];
	payload[0] = NWK_ED_MINIMAL_NWK_TIMEOUT_REQ_CMD_ID;
	payload[1] = timeoutReq;
	payload[2] = 0U;

	memcpy(nonce, g_zbMacPib.extAddress, sizeof(addrExt_t));
	COPY_U32TOBUFFER(&nonce[8], frameCounter);
	nonce[12] = NWK_ED_MINIMAL_NWK_SEC_CTRL;
	enc_len = zb_minimal_ccm_encrypt_auth(key, nonce, NWK_ED_MINIMAL_NWK_MIC_LEN,
					      &frame[idx - nwkHdrLen], nwkHdrLen, payload, 3U,
					      &payload[3]);
	if (enc_len != (u8)(3U + NWK_ED_MINIMAL_NWK_MIC_LEN)) {
		LOG_WRN("joined TX: timeout req encrypt failed len=%u", enc_len);
		return FALSE;
	}

	frame[idx - NWK_ED_MINIMAL_NWK_AUX_HDR_LEN] = NWK_ED_MINIMAL_NWK_SEC_CTRL_WIRE;
	idx = (u8)(idx + enc_len);
	(void)nv_nwkFrameCountSaveToFlash(ss_ib.outgoingFrameCounter);

	rc = zb_platform_radio_send_raw_psdu(frame, idx);
	if (rc < 0) {
		LOG_WRN("joined TX: timeout req tx failed rc=%d", rc);
		return FALSE;
	}

	LOG_INF("joined TX: timeout req parent=0x%04x timeout=%u key=%u fc=%u",
		g_nwkEdCtx.activeParentShortAddr, timeoutReq, keySeq, frameCounter);
	return TRUE;
}

static bool nwk_ed_minimal_get_join_profile(struct zb_platform_bdb_join_profile *profile)
{
	if (profile == NULL) {
		return FALSE;
	}

	memset(profile, 0, sizeof(*profile));
	return zb_platform_app_get_join_profile(profile) ? TRUE : FALSE;
}

static bool nwk_ed_minimal_beacon_matches_join_profile(
	const nwk_ed_minimal_rx_evt_t *evt,
	const struct zb_platform_bdb_join_profile *profile)
{
	if (evt == NULL || profile == NULL) {
		return FALSE;
	}

	if (profile->pan_id_valid && evt->beacon.panId != profile->pan_id) {
		return FALSE;
	}

	if (profile->ext_pan_id_valid &&
	    memcmp(evt->beacon.extPanId, profile->ext_pan_id, sizeof(evt->beacon.extPanId)) != 0) {
		return FALSE;
	}

	return TRUE;
}

static bool nwk_ed_minimal_rx_evt_push(const nwk_ed_minimal_rx_evt_t *evt)
{
	k_spinlock_key_t key;

	if (evt == NULL) {
		return FALSE;
	}

	key = k_spin_lock(&g_nwkEdRxEvtLock);
	if (g_nwkEdRxEvtCount >= NWK_ED_MINIMAL_RX_EVT_Q_LEN) {
		k_spin_unlock(&g_nwkEdRxEvtLock, key);
		return FALSE;
	}

	g_nwkEdRxEvtQ[g_nwkEdRxEvtHead] = *evt;
	g_nwkEdRxEvtHead = (u8)((g_nwkEdRxEvtHead + 1U) % NWK_ED_MINIMAL_RX_EVT_Q_LEN);
	g_nwkEdRxEvtCount++;
	k_spin_unlock(&g_nwkEdRxEvtLock, key);

	return TRUE;
}

static bool nwk_ed_minimal_rx_evt_pop(nwk_ed_minimal_rx_evt_t *evt)
{
	k_spinlock_key_t key;

	if (evt == NULL) {
		return FALSE;
	}

	key = k_spin_lock(&g_nwkEdRxEvtLock);
	if (g_nwkEdRxEvtCount == 0U) {
		k_spin_unlock(&g_nwkEdRxEvtLock, key);
		return FALSE;
	}

	*evt = g_nwkEdRxEvtQ[g_nwkEdRxEvtTail];
	g_nwkEdRxEvtTail = (u8)((g_nwkEdRxEvtTail + 1U) % NWK_ED_MINIMAL_RX_EVT_Q_LEN);
	g_nwkEdRxEvtCount--;
	k_spin_unlock(&g_nwkEdRxEvtLock, key);

	return TRUE;
}

static void nwk_ed_minimal_finish_discovery(u8 status)
{
	bool rejoinFlow = g_nwkEdCtx.discoveryForRejoin;
	nwk_ed_minimal_timer_cancel();
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
	g_nwkEdCtx.lastJoinStatus = status;

	if (!rejoinFlow) {
		tl_zdoEdMinimalDiscoveryDone(status);
	}
}

static void nwk_ed_minimal_finish_join(u8 status, bool rejoinMode)
{
	nwk_ed_minimal_timer_cancel();
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.rejoinWithBackoff = FALSE;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
	g_nwkEdCtx.lastJoinStatus = status;

	if (status != ZDO_SUCCESS && !rejoinMode) {
		g_zbNwkCtx.joined = 0;
	}

	tl_zdoEdMinimalJoinDone(status, rejoinMode);
}

static void nwk_ed_minimal_complete_join(bool rejoinMode)
{
	g_zbNwkCtx.joined = 1U;
	g_zbNwkCtx.is_factory_new = 0U;
	g_zbNwkCtx.parentIsChanged = 0U;
	g_zbNwkCtx.state = NLME_STATE_IDLE;
	g_zbNwkCtx.user_state = NLME_IDLE;
	zb_info_save(NULL);

	LOG_INF("%s complete: short 0x%04x pan 0x%04x parent 0x%04x",
		rejoinMode ? "rejoin" : "join", g_zbNIB.nwkAddr, g_zbNIB.panId,
		g_zbMacPib.coordShortAddress);
	nwk_ed_minimal_finish_join(ZDO_SUCCESS, rejoinMode);
	nwk_ed_minimal_joined_idle_poll_schedule(nwk_ed_minimal_effective_poll_rate());

	if (!rejoinMode) {
		(void)TL_SCHEDULE_TASK(nwk_ed_minimal_post_join_announce_task, NULL);
	}
}

static void nwk_ed_minimal_enter_interview(bool rejoinMode)
{
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_INTERVIEW;
	g_nwkEdCtx.interviewRejoinMode = rejoinMode;
	g_nwkEdCtx.assocPollCount = 0U;
	nwk_ed_minimal_timer_start(NWK_ED_MINIMAL_INTERVIEW_POLL_MS);
}

static bool nwk_ed_minimal_send_data_request(void)
{
	u8 frame[MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_PAN_ID_FIELD_LEN +
		 MAC_SHORT_ADDR_FIELD_LEN + MAC_EXT_ADDR_FIELD_LEN + 1U];
	u8 idx = 0;
	u16 fcf = 0;
	bool useShortSrc = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_INTERVIEW || g_zbNwkCtx.joined) &&
			   (g_zbMacPib.shortAddress < ZB_MAC_SHORT_ADDR_NOT_ALLOCATED);
	int rc;

	fcf |= MAC_FRAME_COMMAND;
	fcf |= MAC_FCF_ACK_REQ_BIT;
	fcf |= MAC_FCF_INTRA_PAN_MASK;
	fcf |= (u16)ZB_ADDR_16BIT_DEV_OR_BROADCAST << MAC_FCF_DST_ADDR_MODE_POS;
	fcf |= (u16)(useShortSrc ? ZB_ADDR_16BIT_DEV_OR_BROADCAST : ZB_ADDR_64BIT_DEV)
	       << MAC_FCF_SRC_ADDR_MODE_POS;

	COPY_U16TOBUFFER(&frame[idx], fcf);
	idx += MAC_FCF_FIELD_LEN;
	frame[idx++] = ZB_MAC_DSN();
	ZB_INC_MAC_DSN();
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activePanId);
	idx += MAC_PAN_ID_FIELD_LEN;
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activeParentShortAddr);
	idx += MAC_SHORT_ADDR_FIELD_LEN;
	if (useShortSrc) {
		COPY_U16TOBUFFER(&frame[idx], g_zbNIB.nwkAddr);
		idx += MAC_SHORT_ADDR_FIELD_LEN;
	} else {
		memcpy(&frame[idx], g_zbMacPib.extAddress, sizeof(addrExt_t));
		idx += sizeof(addrExt_t);
	}
	frame[idx++] = MAC_CMD_DATA_REQUEST;

