devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
	nwk_ed_minimal_complete_join(g_nwkEdCtx.interviewRejoinMode);
}

static void nwk_ed_minimal_post_join_announce_task(void *arg)
{
	ARG_UNUSED(arg);

	if (!g_zbNwkCtx.joined) {
		return;
	}

	if (zb_zdoSendDevAnnance() == ZDO_SUCCESS) {
		tl_zbNwkEdMinimalInterviewPollStart(0U, 0U);
		nwk_ed_minimal_timeout_req_schedule(NWK_ED_MINIMAL_TIMEOUT_REQ_DELAY_MS);
	}
}

static void nwk_ed_minimal_timeout_req_task(void *arg)
{
	ARG_UNUSED(arg);

	g_nwkEdCtx.endDevTimeoutReqScheduled = FALSE;
	if (!g_zbNwkCtx.joined || g_nwkEdCtx.endDevTimeoutRspSeen) {
		return;
	}

	if (!nwk_ed_minimal_send_timeout_request()) {
		nwk_ed_minimal_timeout_req_schedule(NWK_ED_MINIMAL_TIMEOUT_REQ_DELAY_MS);
		return;
	}

	tl_zbNwkEdMinimalInterviewPollStart(0U, 0U);
}

void tl_zbNwkEdMinimalInterviewPollStart(u8 count, u32 intervalMs)
{
	if (!g_zbNwkCtx.joined || g_nwkEdCtx.activePanId == MAC_INVALID_PANID ||
	    g_nwkEdCtx.activeParentShortAddr == MAC_SHORT_ADDR_NONE) {
		return;
	}

	if (count == 0U) {
		count = NWK_ED_MINIMAL_INTERVIEW_POLL_MAX;
	}

	g_nwkEdCtx.interviewPollCount = count;
	g_nwkEdCtx.interviewPollIntervalMs =
		(intervalMs != 0U) ? intervalMs : NWK_ED_MINIMAL_INTERVIEW_POLL_MS;
	nwk_ed_minimal_joined_idle_poll_restart(1U);
}

void tl_zbNwkEdMinimalPollRestart(u32 timeoutMs)
{
	if (!g_zbNwkCtx.joined || g_nwkEdCtx.activePanId == MAC_INVALID_PANID ||
	    g_nwkEdCtx.activeParentShortAddr == MAC_SHORT_ADDR_NONE) {
		return;
	}

	if (timeoutMs == 0U) {
		timeoutMs = nwk_ed_minimal_effective_poll_rate();
	}

	nwk_ed_minimal_joined_idle_poll_restart(timeoutMs);
}

void tl_zbNwkEdMinimalTimeoutRspReceived(u8 status, u8 parentInfo)
{
	g_nwkEdCtx.endDevTimeoutReqScheduled = FALSE;
	nwk_ed_minimal_timeout_req_cancel();
	g_zbNIB.parentInfo = parentInfo;

	if (status == TIMEOUT_RSP_STATUS_SUCCESS) {
		g_nwkEdCtx.endDevTimeoutRspSeen = TRUE;
		LOG_INF("joined RX: timeout rsp ok parentInfo=0x%02x", parentInfo);
		tl_zbNwkEdMinimalInterviewPollStart(0U, 0U);
	} else {
		LOG_WRN("joined RX: timeout rsp status=0x%02x parentInfo=0x%02x", status,
			parentInfo);
	}
}

u32 tl_zbNwkEdMinimalLastScanChannelsGet(void)
{
	return g_nwkEdCtx.lastScanChannels;
}

u32 tl_zbNwkEdMinimalLastRejoinScanChannelsGet(void)
{
	return g_nwkEdCtx.lastRejoinScanChannels;
}

void tl_zbNwkEdMinimalParentCandidateSet(u16 parentShortAddr, const addrExt_t parentIeeeAddr)
{
	g_nwkEdCtx.parentCandidateValid = TRUE;
	g_nwkEdCtx.parentCandidateShortAddr = parentShortAddr;
	if (parentIeeeAddr != NULL) {
		ZB_IEEE_ADDR_COPY(g_nwkEdCtx.parentCandidateIeee, parentIeeeAddr);
	} else {
		ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.parentCandidateIeee);
	}
}

void tl_zbNwkEdMinimalParentCandidateClear(void)
{
	g_nwkEdCtx.parentCandidateValid = FALSE;
	g_nwkEdCtx.parentCandidateShortAddr = MAC_SHORT_ADDR_NONE;
	ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.parentCandidateIeee);
}

bool tl_zbNwkEdMinimalParentCandidateGet(u16 *parentShortAddr, addrExt_t parentIeeeAddr)
{
	if (!g_nwkEdCtx.parentCandidateValid) {
		return FALSE;
	}

	if (parentShortAddr != NULL) {
		*parentShortAddr = g_nwkEdCtx.parentCandidateShortAddr;
	}
	if (parentIeeeAddr != NULL) {
		ZB_IEEE_ADDR_COPY(parentIeeeAddr, g_nwkEdCtx.parentCandidateIeee);
	}

	return TRUE;
}

void tl_zbNwkEdMinimalSetFixedJoinTarget(u8 channel, u16 panId, u16 shortAddr,
					 const u8 *extPanId, const u8 *nwkKey, const u8 *tcAddr)
{
	g_nwkEdCtx.fixedJoinValid = TRUE;
	g_nwkEdCtx.fixedJoinChannel = channel;
	g_nwkEdCtx.fixedJoinPanId = panId;
	g_nwkEdCtx.fixedJoinShortAddr = shortAddr;
	if (extPanId != NULL) {
		ZB_EXTPANID_COPY(g_nwkEdCtx.fixedJoinExtPanId, extPanId);
	} else {
		memset(g_nwkEdCtx.fixedJoinExtPanId, 0, sizeof(g_nwkEdCtx.fixedJoinExtPanId));
	}
	if (nwkKey != NULL) {
		memcpy(g_nwkEdCtx.fixedJoinNwkKey, nwkKey, sizeof(g_nwkEdCtx.fixedJoinNwkKey));
	} else {
		memset(g_nwkEdCtx.fixedJoinNwkKey, 0, sizeof(g_nwkEdCtx.fixedJoinNwkKey));
	}
	if (tcAddr != NULL) {
		ZB_IEEE_ADDR_COPY(g_nwkEdCtx.fixedJoinTcAddr, tcAddr);
	} else {
		ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.fixedJoinTcAddr);
	}

	if (g_zbNwkCtx.joined && panId != MAC_INVALID_PANID &&
	    shortAddr != MAC_SHORT_ADDR_NONE) {
		g_nwkEdCtx.activeChannel = channel;
		g_nwkEdCtx.activePanId = panId;
		g_nwkEdCtx.activeParentShortAddr = shortAddr;
		if (extPanId != NULL) {
			ZB_EXTPANID_COPY(g_nwkEdCtx.activeExtPanId, extPanId);
		}
	}
}

bool tl_zbNwkEdMinimalGetFixedJoinTarget(u8 *channel, u16 *panId, u16 *shortAddr,
					 extPANId_t extPanId, u8 *nwkKey, addrExt_t tcAddr)
{
	if (!g_nwkEdCtx.fixedJoinValid) {
		return FALSE;
	}

	if (channel != NULL) {
		*channel = g_nwkEdCtx.fixedJoinChannel;
	}
	if (panId != NULL) {
		*panId = g_nwkEdCtx.fixedJoinPanId;
	}
	if (shortAddr != NULL) {
		*shortAddr = g_nwkEdCtx.fixedJoinShortAddr;
	}
	if (extPanId != NULL) {
		ZB_EXTPANID_COPY(extPanId, g_nwkEdCtx.fixedJoinExtPanId);
	}
	if (nwkKey != NULL) {
		memcpy(nwkKey, g_nwkEdCtx.fixedJoinNwkKey, sizeof(g_nwkEdCtx.fixedJoinNwkKey));
	}
	if (tcAddr != NULL) {
		ZB_IEEE_ADDR_COPY(tcAddr, g_nwkEdCtx.fixedJoinTcAddr);
	}

	return TRUE;
}

void tl_zbNwkInit(u8 coldReset)
{
	nwk_ed_minimal_reset(coldReset ? FALSE : TRUE);
}

void tl_zbNwkNlmeResetRequestHandler(void *arg)
{
	nlme_reset_req_t *pReq = (nlme_reset_req_t *)arg;
	nlme_reset_cnf_t cnf = {.status = NWK_STATUS_SUCCESS};

	nwk_ed_minimal_reset((pReq != NULL) ? pReq->warmStart : FALSE);

	if (zdoAppIndCbLst != NULL && zdoAppIndCbLst->zdpResetCnfCb != NULL) {
		zdoAppIndCbLst->zdpResetCnfCb(&cnf);
	}
}

void tl_zbNwkTaskProc(void)
{
}

static void nwk_ed_minimal_handle_beacon_event(const nwk_ed_minimal_rx_evt_t *evt)
{
	struct zb_platform_bdb_join_profile profile;
	bool have_profile;

	if (evt == NULL || g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_DISCOVERY) {
		return;
	}

	have_profile = nwk_ed_minimal_get_join_profile(&profile);
	if (have_profile && !nwk_ed_minimal_beacon_matches_join_profile(evt, &profile)) {
		return;
	}

	if (!g_nwkEdCtx.haveBeaconCandidate || (evt->rssi > g_nwkEdCtx.bestBeaconRssi)) {
		g_nwkEdCtx.haveBeaconCandidate = TRUE;
		g_nwkEdCtx.bestBeaconRssi = evt->rssi;
		g_nwkEdCtx.candidatePanId = evt->beacon.panId;
		g_nwkEdCtx.candidateShortAddr = evt->beacon.parentShortAddr;
		ZB_EXTPANID_COPY(g_nwkEdCtx.candidateExtPanId, evt->beacon.extPanId);
		tl_zbNwkEdMinimalParentCandidateSet(evt->beacon.parentShortAddr, NULL);
		tl_zbNwkEdMinimalSetFixedJoinTarget(evt->beacon.channel, evt->beacon.panId,
						    evt->beacon.parentShortAddr, evt->beacon.extPanId,
						    have_profile && profile.network_key_valid ? profile.network_key : NULL,
						    have_profile && profile.tc_addr_valid ? profile.tc_addr : NULL);
		if (have_profile) {
			LOG_INF("matched beacon candidate: pan 0x%04x parent 0x%04x ch %u rssi %d",
				evt->beacon.panId, evt->beacon.parentShortAddr, evt->beacon.channel,
				evt->rssi);
		} else {
			LOG_INF("beacon candidate: pan 0x%04x parent 0x%04x ch %u rssi %d",
				evt->beacon.panId, evt->beacon.parentShortAddr, evt->beacon.channel,
				evt->rssi);
		}
	}
}

static void nwk_ed_minimal_handle_traffic_candidate_event(const nwk_ed_minimal_rx_evt_t *evt)
{
	bool preferNewCandidate;

