devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
	if (evt == NULL || g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_DISCOVERY) {
		return;
	}

	if (g_nwkEdCtx.haveBeaconCandidate) {
		return;
	}

	preferNewCandidate = !g_nwkEdCtx.parentCandidateValid;
	if (!preferNewCandidate &&
	    g_nwkEdCtx.candidateShortAddr != MAC_SHORT_ADDR_BROADCAST &&
	    evt->traffic.parentShortAddr == 0x0000U) {
		preferNewCandidate = TRUE;
	}
	if (!preferNewCandidate && evt->rssi > g_nwkEdCtx.bestBeaconRssi) {
		preferNewCandidate = TRUE;
	}

	if (preferNewCandidate) {
		g_nwkEdCtx.bestBeaconRssi = evt->rssi;
		g_nwkEdCtx.candidatePanId = evt->traffic.panId;
		g_nwkEdCtx.candidateShortAddr = evt->traffic.parentShortAddr;
		memset(g_nwkEdCtx.candidateExtPanId, 0, sizeof(g_nwkEdCtx.candidateExtPanId));
		tl_zbNwkEdMinimalParentCandidateSet(evt->traffic.parentShortAddr, NULL);
		tl_zbNwkEdMinimalSetFixedJoinTarget(evt->traffic.channel, evt->traffic.panId,
						    evt->traffic.parentShortAddr, NULL,
						    NULL, NULL);
		LOG_INF("traffic candidate: pan 0x%04x parent 0x%04x ch %u rssi %d",
			evt->traffic.panId, evt->traffic.parentShortAddr,
			evt->traffic.channel, evt->rssi);
	}
}

static void nwk_ed_minimal_handle_assoc_rsp_event(const nwk_ed_minimal_rx_evt_t *evt)
{
	u8 zdoStatus;
	bool rejoinMode;

	if (evt == NULL) {
		return;
	}
	if (g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_JOINING &&
	    g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_REJOIN) {
		return;
	}

	rejoinMode = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_REJOIN);
	if (evt->assocRsp.srcShortValid &&
	    evt->assocRsp.srcShortAddr != g_nwkEdCtx.activeParentShortAddr) {
		return;
	}
	if (evt->assocRsp.dstExtValid &&
	    memcmp(evt->assocRsp.dstExtAddr, g_zbMacPib.extAddress, sizeof(addrExt_t)) != 0) {
		return;
	}
	if (evt->assocRsp.dstShortValid &&
	    evt->assocRsp.dstShortAddr != MAC_SHORT_ADDR_BROADCAST &&
	    evt->assocRsp.dstShortAddr != g_zbMacPib.shortAddress) {
		return;
	}

	if (evt->assocRsp.macStatus == MAC_SUCCESS) {
		if (evt->assocRsp.srcExtValid) {
			tl_zbNwkEdMinimalParentCandidateSet(g_nwkEdCtx.activeParentShortAddr,
							      evt->assocRsp.srcExtAddr);
			ZB_IEEE_ADDR_COPY(g_zbMacPib.coordExtAddress, evt->assocRsp.srcExtAddr);
		}
		nwk_ed_minimal_apply_tc_context();

		g_zbMacPib.panId = g_nwkEdCtx.activePanId;
		g_zbMacPib.shortAddress = evt->assocRsp.assignedShortAddr;
		g_zbMacPib.coordShortAddress = g_nwkEdCtx.activeParentShortAddr;
		g_zbMacPib.associatedPanCoord = TRUE;
		tlsr8258_zigbee_update_filters(g_nwkEdCtx.activePanId,
						 evt->assocRsp.assignedShortAddr,
						 g_zbMacPib.extAddress);

		g_zbNIB.panId = g_nwkEdCtx.activePanId;
		g_zbNIB.nwkAddr = evt->assocRsp.assignedShortAddr;
		g_zbNIB.depth = 1U;
		ZB_EXTPANID_COPY(g_zbNIB.extPANId, g_nwkEdCtx.activeExtPanId);

		if (!aps_ib.aps_authenticated) {
			LOG_INF("%s associated: short 0x%04x pan 0x%04x parent 0x%04x, waiting transport key",
				rejoinMode ? "rejoin" : "join", evt->assocRsp.assignedShortAddr,
				g_nwkEdCtx.activePanId, g_nwkEdCtx.activeParentShortAddr);
			nwk_ed_minimal_enter_interview(rejoinMode);
			return;
		}

		nwk_ed_minimal_complete_join(rejoinMode);
		return;
	}

	switch (evt->assocRsp.macStatus) {
	case MAC_STA_PAN_AT_CAPACITY:
		zdoStatus = ZDO_TABLE_FULL;
		break;
	case MAC_STA_PAN_ACCESS_DENIED:
		zdoStatus = ZDO_NOT_PERMITTED;
		break;
	default:
		zdoStatus = ZDO_NOT_SUPPORTED;
		break;
	}

	LOG_WRN("%s association rejected: mac status 0x%02x",
		rejoinMode ? "rejoin" : "join", evt->assocRsp.macStatus);
	nwk_ed_minimal_finish_join(zdoStatus, rejoinMode);
}

static void nwk_ed_minimal_rx_event_task(void *arg)
{
	nwk_ed_minimal_rx_evt_t evt;

	ARG_UNUSED(arg);
	while (nwk_ed_minimal_rx_evt_pop(&evt)) {
		switch (evt.type) {
		case NWK_ED_MINIMAL_RX_EVT_BEACON:
			nwk_ed_minimal_handle_beacon_event(&evt);
			break;
		case NWK_ED_MINIMAL_RX_EVT_TRAFFIC_CANDIDATE:
			nwk_ed_minimal_handle_traffic_candidate_event(&evt);
			break;
		case NWK_ED_MINIMAL_RX_EVT_ASSOC_RSP:
			nwk_ed_minimal_handle_assoc_rsp_event(&evt);
			break;
		default:
			break;
		}
	}
}

void tl_zbNwkEdMinimalMacRxIndicate(const u8 *macPld, u8 len, s8 rssi)
{
	nwk_ed_minimal_mac_hdr_t hdr;
	u8 payloadLen;
	nwk_ed_minimal_rx_evt_t evt;
	bool discoveryActive;
	bool joinActive;

	if (macPld == NULL || len < (MAC_MIN_HDR_LEN + 2U)) {
		return;
	}

	discoveryActive = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_DISCOVERY);
	joinActive = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_JOINING) ||
		     (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_REJOIN);

	/* Incoming PSDU includes FCS bytes at the end. */
	payloadLen = (u8)(len - 2U);
	if (!nwk_ed_minimal_parse_mac_header(macPld, payloadLen, &hdr)) {
		return;
	}

	if (hdr.frameType == MAC_FRAME_BEACON) {
		u16 panId = MAC_INVALID_PANID;
		u16 parentShortAddr = MAC_SHORT_ADDR_NONE;
		extPANId_t extPanId = {0};

		if (!discoveryActive) {
			return;
		}

		if (!nwk_ed_minimal_parse_beacon_candidate(macPld, payloadLen, &hdr, &panId,
							   &parentShortAddr, extPanId)) {
			return;
		}

		memset(&evt, 0, sizeof(evt));
		evt.type = NWK_ED_MINIMAL_RX_EVT_BEACON;
		evt.rssi = rssi;
		evt.beacon.panId = panId;
		evt.beacon.parentShortAddr = parentShortAddr;
		evt.beacon.channel = rf_getChannel();
		ZB_EXTPANID_COPY(evt.beacon.extPanId, extPanId);
		if (nwk_ed_minimal_rx_evt_push(&evt)) {
			(void)TL_SCHEDULE_TASK(nwk_ed_minimal_rx_event_task, NULL);
		} else {
		}
		return;
	}

	if (hdr.frameType == MAC_FRAME_DATA && hdr.srcPanValid && hdr.srcShortValid &&
	    hdr.dstShortValid && hdr.dstShortAddr == MAC_SHORT_ADDR_BROADCAST) {
		if (!discoveryActive) {
			return;
		}

		memset(&evt, 0, sizeof(evt));
		evt.type = NWK_ED_MINIMAL_RX_EVT_TRAFFIC_CANDIDATE;
		evt.rssi = rssi;
		evt.traffic.panId = hdr.srcPanId;
		evt.traffic.parentShortAddr = hdr.srcShortAddr;
		evt.traffic.channel = rf_getChannel();
		if (nwk_ed_minimal_rx_evt_push(&evt)) {
			(void)TL_SCHEDULE_TASK(nwk_ed_minimal_rx_event_task, NULL);
		}
		return;
	}

	if (hdr.frameType == MAC_FRAME_COMMAND) {
		u8 cmdIdx = hdr.headerLen;
		u8 cmdId;
		u8 assocStatus;

