devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
		if (cmdIdx + 4U > payloadLen) {
			return;
		}
		cmdId = macPld[cmdIdx];
		if (cmdId == MAC_CMD_DATA_REQUEST &&
		    hdr.srcPanValid &&
		    hdr.dstShortValid &&
		    hdr.dstShortAddr != MAC_SHORT_ADDR_BROADCAST) {
			if (!discoveryActive) {
				return;
			}
			memset(&evt, 0, sizeof(evt));
			evt.type = NWK_ED_MINIMAL_RX_EVT_TRAFFIC_CANDIDATE;
			evt.rssi = rssi;
			evt.traffic.panId = hdr.srcPanId;
			evt.traffic.parentShortAddr = hdr.dstShortAddr;
			evt.traffic.channel = rf_getChannel();
			if (nwk_ed_minimal_rx_evt_push(&evt)) {
				(void)TL_SCHEDULE_TASK(nwk_ed_minimal_rx_event_task, NULL);
			}
			return;
		}
		if (cmdId != MAC_CMD_ASSOCIATION_RESPONSE) {
			return;
		}
		if (!joinActive) {
			return;
		}
		memset(&evt, 0, sizeof(evt));
		evt.type = NWK_ED_MINIMAL_RX_EVT_ASSOC_RSP;
		assocStatus = macPld[cmdIdx + 3U];
		evt.assocRsp.macStatus = assocStatus;
		evt.assocRsp.assignedShortAddr = nwk_ed_minimal_u16_from_le(&macPld[cmdIdx + 1U]);
		evt.assocRsp.srcExtValid = hdr.srcExtValid;
		evt.assocRsp.srcShortValid = hdr.srcShortValid;
		evt.assocRsp.srcShortAddr = hdr.srcShortAddr;
		evt.assocRsp.dstExtValid = hdr.dstExtValid;
		evt.assocRsp.dstShortValid = hdr.dstShortValid;
		evt.assocRsp.dstShortAddr = hdr.dstShortAddr;
		if (hdr.srcExtValid) {
			ZB_IEEE_ADDR_COPY(evt.assocRsp.srcExtAddr, hdr.srcExtAddr);
		}
		if (hdr.dstExtValid) {
			ZB_IEEE_ADDR_COPY(evt.assocRsp.dstExtAddr, hdr.dstExtAddr);
		}
		if (nwk_ed_minimal_rx_evt_push(&evt)) {
			(void)TL_SCHEDULE_TASK(nwk_ed_minimal_rx_event_task, NULL);
		}
	}
}
